"use client"
import Image from "next/image";
import Slider from "react-slick";

const Testimonial3 = () => {

    const settings = {
        dots: false,
        infinite: true,
        speed: 2000,
        slidesToShow: 1,
        slidesToScroll: 1,
        arrows: false,
        swipeToSlide: true,
        autoplay: true,
        autoplaySpeed: 4000,        
        responsive: [
          {
            breakpoint: 1399,
            settings: {
              slidesToShow: 1,
            }
          },
          {
            breakpoint: 1199,
            settings: {
              slidesToShow: 1,
            }
          },{
            breakpoint: 575,
            settings: {
              slidesToShow: 1,
            }
          }
        ]
      };  

      const testimonialContent = [
        {img:'/assets/img/testimonial/01.png', subtitle:'Шинэ Монгол Коосэнгийн 1-р үеийн төгсөгч', title:'Э.Энх-Уянга ', content:'Би Шинэ Монгол коосэн сургуульд 2014 онд элсэн орсон. Тухайн үед коосэн гэсэн ойлголт байгаагүй тул бусад дунд сургуультай адилхан гэж ойлгодог байсан. Хичээл нь маш хүнд буюу дунд сургуулийн 9-р ангийн хүүхэд гэнэт л их дээд сургуулийн хичээл үзэхийн хажуугаар багш нар нь маш их хоцрогдолтой байна гэж байнга хэлэх нь нэгэн бодлын дарамт ч юм шиг санагддаг байлаа (үнэн хэрэгтээ хоцрогдсон нь үнэн л байсан юм). Хоцрогдлоо хурдан нөхөхийн зэрэгцээ мэргэжлийн хичээлээ алдчихгүй гээд нойртой, нойргүй гүйсээр байтал нэг мэдэхэд 12-р ангиа төгсч, 3 жилийг ардаа орхисон байв. Энэ үеэс л Коосэн бол ерөнхий боловсролын мэдлэг авахын зэрэгцээ мэргэжлийн Хичээлээ давхар үзчихдэг ийм л үр дүнтэй сургалтын хэлбэр гэдгийг ойлгож авсан. Сургуулийнхаа багш нарын ачаар төгсөхөөсөө өмнө ажил хийх хүсэлтээ сургуулийн захиргаанд хэлсний дагуу Японы Дай-ичи Коогёо Сэияку (DKS Co.,ltd.) компанид ярилцлагад орж тэнцсэнээр ажлын урилга авсан. Ингээд сургуулиа төгсч 2019 оны 8 сард Япон улсын Шига хотын салбарт нь ирж ажиллаж байна. Эцэст нь бидэнд бүхий л зүйлсээ зааж сургасан Шинэ Монгол коосэнгийн бүх багш, ажилчдадаа талархаж буйгаа илэрхийлье.'},
        {img:'/assets/img/testimonial/02.png', subtitle:'Шинэ Монгол Коосэнгийн 1-р үеийн төгсөгч', title:'Ч.Даваадорж', content:'Би 2014 онд Шинэ Монгол коосэн-нд нисэх онгоцний инженер болох хүсэл мөрөөдөлтэй орж ирсэн. Бага наснаасаа нисэх онгоцийг сонирхож тэр том аварга онгоц хэрхэн нисдэгийг гайхаж, мэдэхийг хүсдэг байлаа. Шинэ Монгол технологийн коллеж-д ороод сургуулийнхаа нисэх загварын дугуйланд хичээллэж, тэмцээн уралдаанд тасралтгүй оролцож ирсэн. Гэвч Монголд нисэх онгоцний инженер болох маш хэцүү гэдгийг сонсоод шантарч байсан ч зорилгоосо няцалгүй үргэлжлүүлэн нисэх загварын дугуйланда хичээллэж Робоконы багт орсон. 5-р курсэд ороод Японы нэр хүнд бүхий агаарын тээврийн ANA болон JAL компаниас нисэх онгоцны инженер чиглэлээр Монголын коосэн сургуулиудтай хамтарч ажиллана гэдгийг сонсоод тус компаниудад очиж дадлага хийсэн. Шинэ Монгол технологийн коллежийн дүү нартаа захихад, өөрийнхөө мөрөөдлийг зориллго болгож, түүнийхээ төлөө тууштай тэмцэж, ажиллахыг хүссэн чиглэлээрээ хичээлээс гадуурх секц дугуйланд хамрагдаж өөрийгөө хөгжүүлээрэй.'},      
    ]; 

    return (
        <section className="testimonial-section-3 section-padding pt-0">
            <div className="container">
                <div className="testimonial-wrapper-3">
                    <div className="swiper testimonial-slider-2">
                        <div className="swiper-wrapper">
                        <Slider {...settings}>
                        {testimonialContent.map((item, i) => (                            
                            <div key={i} className="swiper-slide">
                              <div className="client-info">
                                        <div className="client-img">
                                        <Image src={item.img} alt="img" width={50} height={50}   />                                          
                                        </div>
                                        <div className="content">
                                            <h6>{item.title}</h6>
                                            <span>{item.subtitle}</span>
                                        </div>
                                    </div>
                                <div className="testimonial-content">                   
                                    <p>
                                    {item.content}
                                    </p>
                                </div>
                            </div>
                            ))}
                            </Slider>


                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default Testimonial3;