"use client"
import Image from "next/image";
import Link from "next/link";
import { useEffect, useRef, useState } from "react";

const ServiceDetails = () => {
    const [activeTab, setActiveTab] = useState(0);

    const departments = [
        {
            title: "Ерөнхий эрдэм",
            description: "Шинэ Монгол Технологийн Коллежийн ерөнхий эрдмийн тэнхим нь сургуулийн эрхэм зорилго, алсын хараа, зарчим, төгсөгчийн загварыг үндэс болгон эрүүл чийрэг, эх хэл өв соёлоо эрхэмлэн дээдэлдэг, шинжлэх ухааны хэл болох математик, хүн төрөлхтний түүх, нийгэм-эдийн засгийн тогтолцооны арга ухааныг танин мэдэж, даяаршлалын эрин үед гадаад хэл-соёлд суралцан, улс орны аж үйлдвэрийн бүтээн байгуулалтад хувь нэмэр оруулах инженер технологийн мэргэжилтэнд шаардлагатай байгалийн шинжлэх ухааны суурь мэдлэг чадвар эзэмшсэн, тулгарсан аливаа асуудлыг бизнесийн бүтээлч сэтгэлгээгээр шийдвэрлэх 21-р зууны иргэн бэлтгэхийг зорино.",
            features: [
                "Нийгэм болон байгалийн шинжлэх ухаанд суралцахуй",
                "Нийгэмших арга, ухаанд суралцахуй",
                "Эх хэл, өв соёлоо дээдлэх Гадаад хэл харилцааны чадварт суралцахуй",
                "Юмс үзэгдлийн мөн чанарыг танин мэдэх чадварт суралцахуй",
                "Эрүүл чийрэг, зөв дадалтай амьдрах чадварт суралцахуй"
            ],
            activities: [
                "Оюутны шинжлэх ухааны бага хурал",
                "Олон улсын эрдэм шинжилгээний төслүүд",
                "Сургалтын арга зүйн семинар",
                "Оюутны клубүүдийн үйл ажиллагаа"
            ],
            images: [
                "/assets/img/service/eronhii-2.jpg",
                "/assets/img/service/eronhii.jpg",
                "/assets/img/service/eronhii-3.png"
            ]
        },
        {
            title: "Механик инженер",
            description: "Механик инженерийн тэнхим нь сургуулийн эрхэм зорилго, алсын хараа, зарчим, төгсөгчийн загварыг үндэс болгон материалын шинж чанарыг зөв танин мэдэж, механик инженерийн зураг төслийг боловсруулж үүнд үндэслэн механик эд анги, системийг боловсруулах технологийг эзэмшсэн инженерыг бэлтгэхийг зорино.",
            features: [
                "Хэрэглээний физик, математик, онолын механик, материалын эсэргүүцэл, хэмжил зүй, машин механизмын эд анги, техникийн зураг зүй, инженерийн ёс зүй зэрэг суурь мэдлэг чадварыг эзэмшүүлэх.",
                "Материалын бүтэц, шинж чанар, түүний боловсруулагдах чадварыг судалж, механик инженерийн эд анги, системд шаардлагатай материалыг сонгох чадварыг эзэмшүүлэх.",
                "CAD програм, Drafter ашиглан механик эд анги, механизмын зураг төслийг боловсруулж, симмуляцийн хийх чадварыг эзэмшүүлэх.",
                "CAM, металл боловсруулах суурь машин, механик инженерийн хэмжилтийн багаж, ширээлт гагнуурын төхөөрөмж, тэдгээрийг ашиглаж туршилт, судалгааны ажлыг хийх технологийг эзэмшүүлэх.",
                "Аж үйлдвэр, шинжлэх ухааны салбартай хамтарсан төслөт, дадлага ажилд оролцуулж, бодит ажлын байрт шаардлагатай чадварыг эзэмшүүлэх.",
                "Орчин үеийн техник, технологийн шийдлийг олон нийт, аж ахуйн нэгжид түгээн таниулах."
            ],
            activities: [
                "Механик инженерчлэлийн олимпиад",
                "Машины загварчлалын уралдаан",
                "Үйлдвэрлэлийн технологийн семинар",
                "Оюутны инновацийн төслүүд"
            ],
            images: [
                "/assets/img/service/mech-3.png",
                "/assets/img/service/mech-2.png",
                "/assets/img/service/mech.png"
            ]
        },
        {
            title: "Цахилгааны инженер",
            description: "Сургуулийн эрхэм зорилго, Алсын хараа, зарчим, төгсөгчийн загварыг суурь болгон цахилгаан эрчим хүч, электроник, мэдээллийн технологийн үндэс суурь, түүний хэрэглээг сурч эзэмшиж, аж үйлдвэр, нийгмийн хэрэгцээг хангахуйц цахилгаан, электрон, мэдээллийн систем болон бүтээгдэхүүнийг ашиглах, зохион бүтээх чадвартай инженер бэлтгэхийг зорьно.",
            features: [
                "Хэрэглээний физик, математик, цахилгаан соронзон, цахилгаан, электрон хэлхээ, компьютерийн хэрэглээ, програмчлалын үндэс, инженерийн туршилт, хэмжил зүй, инженерийн ёс зүй зэрэг суурь мэдлэг чадварыг эзэмшүүлэх.",
                "CAD програм ашиглан цахилгаан, электрон хэлхээний зураг төслийг боловсруулж, симмулэйшн хийх чадварыг эзэмшүүлэх.",
                "Цахилгаан, электроник инженерийн хэмжилтийн багаж, гагнуурын төхөөрөмж, тэдгээрийн хөдөлмөрийн аюулгүй байдлыг ханган ашиглаж туршилт, судалгааны ажлыг хийх технологийг эзэмшүүлэх.",
                "Орчин үеийн техник, технологийн шийдлийг олон нийт, аж ахуйн нэгжид түгээн таниулах.",
                "Цахилгаан тоног төхөөрөмж, микро контроллер, эмбедед систем, электрон эд анги, тэдгээрийн бүтэц, ажиллагааны шинж чанарыг судалж, цахилгаан, электрон систем болон бүтээгдэхүүн зохион бүтээх, түүнд шаардлагатай материалыг сонгох чадварыг эзэмшүүлэх.",
                "Аж үйлдвэр, шинжлэх ухааны салбартай хамтарсан төсөл, дадлага ажилд оролцуулж, бодит ажлын байрт шаардлагатай чадварыг эзэмшүүлэх."
            ],
            activities: [
                "Цахилгаан системийн олимпиад",
                "Автоматжуулалтын уралдаан",
                "Эрчим хүчний хэмнэлтийн төслүүд",
                "Оюутны инновацийн төслүүд"
            ],
            images: [
                "/assets/img/service/details-1.jpg",
                "/assets/img/service/details-2.jpg",
                "/assets/img/service/details-1.jpg"
            ]
        },
        {
            title: "Химийн инженер",
            description: "Химийн инженерийн тэнхим нь сургуулийн үзэл санаа, алсын хараа, эрхэм зорилго, зарчим, төгсөгчийн загварыг суурь болгож, инженерийн этик, хими-биотехнологийн лабораторид ажиллах дадал, орчин үеийн лабораторийн тоног төхөөрөмжийг ашиглах чадварыг эзэмшиж, аж үйлдвэрлэлийн шинэ бүтээгдэхүүн гаргах, үүнд шаардагдах түүхий эд материалыг мэргэжлийн түвшинд сонгох чадвартай химийн инженерийг бэлтгэхийг зорино.",
            features: [
                "Органик ба органик бус хими, аналитик хими, инженерийн үндэс, биотехнологи, хэрэглээний математик, ерөнхий физик, техник дизайны үндэс хичээлээр инженерийн суурь мэдлэг чадварыг онол болон туршилтын ажлаар эзэмшүүлнэ.",
                "Керамик хими, органик ба органик бус материал судлал, материалын химийн туршилт, химийн тоног төхөөрөмж дээр хийх дадлага хичээлээр материалын хими, физик шинж чанарыг тодорхойлох чадварыг эзэмшүүлнэ.",
                "Аж үйлдвэр, шинжлэх ухааны салбартай хамтарсан төсөл, дадлага ажилд оролцуулах, үйлдвэрлэлийн дадлага, 'Төгсөлтийн төсөл' хийлгэх замаар, судалгаа шинжилгээ, асуудал шийдвэрлэх, ургуулан бодох бүтээлч сэтгэлгээ, бодит ажлын байрт шаардлагатай чадварыг эзэмшүүлнэ.",
                "Инженерийн ёс зүй, ахисан түвшний органик ба органик биш хими, физик хими, онолын органик хими, химийн инженерчлэл, урвал судлал, багажит анализ хичээлээр химийн инженерийн суурь мэдлэг чадварыг олгоно.",
                "Биохими, биокатализатор, биохимийн техник, өсгөвөрлөлтийн инженерчлэл, хэрэглээний микробиологи, ургамлын биотехнологи, эс генийн инженерчлэл зэрэг хичээлээр био-инженерчлэлийн суурь мэдлэг чадварыг эзэмшүүлнэ."
            ],
            activities: [
                "Химийн инженерчлэлийн олимпиад",
                "Материал судлалын семинар",
                "Химийн процессын загварчлал",
                "Оюутны эрдэм шинжилгээний бага хурал"
            ],
            images: [
                "/assets/img/service/details-2.jpg",
                "/assets/img/service/details-1.jpg",
                "/assets/img/service/details-2.jpg"
            ]
        },
        {
            title: "Компьютерийн ухаан",
            description:[ 
            "Компьютерийн ухааны тэнхим нь программ хангамжийг зохиомжилж, бүтээж, хэрэгжүүлдэг.",
            "Компьютерийн ухааны онолын суурь мэдлэгтэй, ажлыг гүйцэтгэх хамгийн сайн оновчтой алгоритм шийдлүүдийг гаргадаг.",
            "Нийгмийн бүх салбарт компьютерийн ухааныг ашиглаж болохуйц арга технологиудыг шинээр бий болгох чадвартай мэргэшсэн инженерүүдийг бэлтгэдэг.",
            "Алгоритм программчлалын шийдлүүдийг оновчтой, өндөр түвшинд хийх.",
            "Магадлалын онол, математик статистикийн өргөн мэдлэгтэй.",
            "Орчин үеийн шинэ технологийг практикт туршиж, үйлдвэрлэлд нэвтрүүлэх.",
            "Хиймэл оюун ухаан, машин сургалттай холбоотой моделиудыг хэрэгжүүлэх чадвартай.",
            "Нийгмийн бүхий л салбарт гарах аливаа асуудалд нийцэхүйц системийг тодорхойлох, томьёолох, шийдвэрлэх мэргэжлийн ур чадваруудыг эзэмшсэн байна.",
            "Тус тэнхим нь 2022-2023 оны хичээлийн жилд байгуулагдан үйл ажиллагаагаа эхлүүлээд байна.",
            ],
            features: [
                "Инженерийн анхан шатны суурь ойлголт",
                "Цахилгаан, электроникийн суурь ойлголтууд",
                "Алгоритм, программчлалын үндэс, ахисан түвшний ойлголтууд",
                "Компьютерийн ухааны мэргэжлийн хичээлүүд (Мэдээллийн нууцлал хамгаалалт, зүйлсийн интернет, үүлэн программчлал, мехатроник ...)",
                "Дээд математик, байгалийн шинжлэх ухааны ухагдахууны хичээлүүд",
                "Компьютерийн ухааны ахисан түвшний хичээлүүд (Хиймэл оюун ухаан, их өгөгдөл, биоинформатик, магадлалын онол математик статистик ...)",
                "Хичээлүүдээр үзсэн агуулгын дагуу туршилтын ажлууд хийх бөгөөд мэргэжлийн компаниудаар зочилж үйлдвэрлэлийн дадлага хийх"
            ],
            activities: [
                "Програмчлалын олимпиад",
                "Хакертон уралдаан",
                "Мэдээллийн технологийн семинар",
                "Оюутны старт-ап төслүүд"
            ],
            images: [
                "/assets/img/service/details-1.jpg",
                "/assets/img/service/details-2.jpg",
                "/assets/img/service/details-1.jpg"
            ]
        }
    ];

    const faqContent = [
        {title:'Why Is SEO Important For Small Business?', content:'Nullam faucibus eleifend mi eu varius. Integer vel tincidunt massa, quis semper odio.Mauris et mollis quam. Nullam fringilla erat id ante commodo maximus'},
        {title:'How do I choose the best SEO Agency?', content:'Nullam faucibus eleifend mi eu varius. Integer vel tincidunt massa, quis semper odio.Mauris et mollis quam. Nullam fringilla erat id ante commodo maximus'},
        {title:'Better Security And Faster Server?', content:'Nullam faucibus eleifend mi eu varius. Integer vel tincidunt massa, quis semper odio.Mauris et mollis quam. Nullam fringilla erat id ante commodo maximus'},
        {title:'Deployment Within Few Minutes', content:'Nullam faucibus eleifend mi eu varius. Integer vel tincidunt massa, quis semper odio.Mauris et mollis quam. Nullam fringilla erat id ante commodo maximus'},
    ]; 

    const accordionContentRef = useRef(null);
    const [openItemIndex, setOpenItemIndex] = useState(-1);
    const [firstItemOpen, setFirstItemOpen] = useState(true);

    const handleItemClick = index => {
        if (index === openItemIndex) {
            setOpenItemIndex(-1);
        } else {
            setOpenItemIndex(index);
        }
    };
    useEffect(() => {
        if (firstItemOpen) {
            setOpenItemIndex(0);
            setFirstItemOpen(false);
        }
    }, [firstItemOpen]);

    return (
        <section className="service-details-section section-padding">
            <div className="container">
                <div className="service-details-wrapper">
                    <div className="row">
                        <div className="col-lg-12">
                            <div className="details-image">
                                <Image 
                                    src={departments[activeTab].images[0]} 
                                    alt={departments[activeTab].title} 
                                    width={1386} 
                                    height={664}   
                                />
                            </div>
                        </div>
                    </div>
                    <div className="row g-5">
                        <div className="col-12 col-lg-4">
                            <div className="main-sidebar sticky-style">
                                <div className="single-sidebar-widget">
                                    <div className="wid-title">
                                        <h4>Тэнхимүүд</h4>
                                    </div>
                                    <div className="service-widget-categories">
                                        <ul>
                                            {departments.map((department, index) => (
                                                <li 
                                                    key={index}
                                                    className={activeTab === index ? "active" : ""}
                                                    onClick={() => setActiveTab(index)}
                                                >
                                                    {department.title} 
                                                    <span><i className="bi bi-arrow-right"></i></span>
                                                </li>
                                            ))}
                                        </ul>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div className="col-12 col-lg-8">
                            <div className="service-details-content">
                                <h3>{departments[activeTab].title}</h3>
                                <p className="mb-4">
                                    {departments[activeTab].description}
                                </p>
                                <h4 className="mt-5">Тэнхимийн онцлог</h4>
                                <ul className="features-list">
                                    {departments[activeTab].features.map((feature, index) => (
                                        <li key={index}><i className="bi bi-asterisk"> </i>{feature}</li>
                                    ))}
                                </ul>

                                <h4 className="mt-5">Тэнхимийн үйл ажиллагаа</h4>
                                <ul className="activities-list">
                                    {departments[activeTab].activities.map((activity, index) => (
                                        <li key={index}><i className="bi bi-check-circle-fill"></i>{activity}</li>
                                    ))}
                                </ul>

                                <h4 className="mt-5">Онцлох зургууд</h4>
                                <div className="row mt-4">
                                    {departments[activeTab].images.map((image, index) => (
                                        <div key={index} className="col-md-4 mb-4">
                                            <Image 
                                                src={image} 
                                                alt={`${departments[activeTab].title} - Зураг ${index + 1}`} 
                                                width={300} 
                                                height={200}
                                                className="img-fluid rounded"
                                            />
                                        </div>
                                    ))}
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default ServiceDetails;